# -*- coding:utf-8 -*-


import os
import random
import cv2
import imutils
import numpy as np
# 处理图片方法




def changyongzi(num='500'):
    if num == '500':
        textlist = ['装', '士', '片', '少', '治', '物', '界', '信', '图', '力', '分', '每', '义', '类', '才', '能', '决', '口', '件', '区',
                    '话', '以',
                    '军', '说', '放', '死', '金', '我', '并', '爬', '敌', '形', '个', '头', '线', '跑', '睛', '不', '马', '五', '底', '眼',
                    '组', '亲',
                    '事', '清', '赶', '它', '学', '机', '你', '想', '花', '候', '近', '年', '穿', '角', '林', '九', '一', '着', '雨', '往',
                    '那', '术',
                    '可', '草', '习', '广', '油', '研', '石', '化', '而', '证', '真', '器', '次', '水', '理', '向', '打', '照', '您', '告',
                    '织', '示',
                    '单', '解', '元', '变', '还', '干', '党', '许', '即', '联', '求', '统', '质', '观', '们', '主', '月', '万', '东', '认',
                    '教', '家',
                    '忙', '三', '拉', '边', '响', '如', '车', '计', '什', '议', '运', '深', '很', '己', '导', '样', '回', '增', '唱', '史',
                    '会', '常',
                    '进', '规', '十', '青', '倒', '行', '吧', '斗', '空', '带', '历', '地', '作', '听', '据', '菜', '命', '半', '农', '离',
                    '战', '也',
                    '思', '阳', '科', '去', '后', '速', '今', '制', '至', '其', '西', '望', '兴', '实', '中', '用', '经', '安', '体', '第',
                    '将', '是',
                    '应', '四', '文', '团', '道', '和', '日', '完', '领', '验', '病', '情', '整', '送', '啊', '千', '特', '时', '济', '题',
                    '脚', '及',
                    '种', '住', '志', '画', '式', '该', '笑', '晚', '点', '无', '任', '字', '确', '爷', '之', '村', '伟', '问', '妈', '看',
                    '未', '些',
                    '就', '大', '采', '子', '了', '阶', '呢', '位', '部', '提', '节', '开', '给', '性', '根', '公', '权', '叫', '多', '海',
                    '更', '员',
                    '通', '的', '办', '快', '产', '同', '找', '没', '现', '果', '七', '步', '表', '造', '交', '数', '下', '她', '土', '白',
                    '像', '高',
                    '只', '基', '块', '越', '手', '具', '来', '出', '路', '动', '争', '方', '见', '睡', '电', '过', '改', '合', '社', '工',
                    '从', '记',
                    '得', '成', '期', '段', '集', '再', '华', '为', '气', '又', '识', '么', '把', '外', '身', '上', '究', '都', '温', '呀',
                    '设', '二',
                    '连', '已', '雪', '感', '便', '原', '建', '世', '加', '色', '关', '达', '指', '谁', '师', '使', '阵', '比', '面', '必',
                    '取', '古',
                    '利', '较', '务', '够', '群', '意', '早', '怎', '发', '亮', '脸', '正', '直', '他', '所', '活', '律', '刻', '这', '相',
                    '做', '积',
                    '资', '儿', '南', '况', '生', '心', '处', '让', '在', '嘴', '极', '难', '起', '小', '目', '转', '条', '品', '好', '传',
                    '且', '代',
                    '紧', '六', '场', '量', '屋', '老', '到', '跟', '受', '怕', '因', '此', '等', '似', '知', '要', '八', '拿', '里', '管',
                    '接', '别',
                    '美', '程', '父', '准', '流', '间', '新', '火', '热', '山', '最', '坐', '前', '名', '长', '明', '级', '门', '讲', '树',
                    '张', '者',
                    '天', '平', '百', '书', '系', '切', '由', '声', '定', '入', '结', '满', '业', '共', '队', '展', '料', '两', '或', '星',
                    '与', '风',
                    '本', '哪', '革', '黑', '象', '保', '先', '内', '吃', '立', '重', '轻', '服', '论', '但', '船', '有', '夜', '河', '北',
                    '几', '反',
                    '站', '例', '报', '政', '则', '刚', '各', '民', '需', '全', '法', '觉', '当', '然', '席', '自', '压', '米', '人', '走',
                    '写', '却',
                    '飞', '于', '对', '国', '爸', '太', '女', '孩', '度', '被', '吗', '总', '爱', '强', '收', '光']
        return textlist
    elif num == 'bjx':

        textList = ['王', '李', '张', '刘', '陈', '杨', '黄', '吴', '赵', '周', '徐', '孙', '马', '朱', '胡', '林', '郭', '何', '高', '罗',
                    '郑', '梁',
                    '谢', '宋', '唐', '许', '邓', '冯', '韩', '曹', '曾', '彭', '萧', '蔡', '潘', '田', '董', '袁', '于', '余', '叶', '蒋',
                    '杜', '苏',
                    '魏', '程', '吕', '丁', '沈', '任', '姚', '卢', '傅', '钟', '姜', '崔', '谭', '廖', '范', '汪', '陆', '金', '石', '戴',
                    '贾', '韦',
                    '夏', '邱', '方', '侯', '邹', '熊', '孟', '秦', '白', '江', '阎', '薛', '尹', '段', '雷', '黎', '史', '龙', '陶', '贺',
                    '顾', '毛',
                    '郝', '龚', '邵', '万', '钱', '严', '赖', '覃', '洪', '武', '莫', '孔', '司马', '上官', '欧阳', '夏侯', '诸葛', '闻人',
                    '南宫', '西门', '东门', '左丘', '梁丘', '颛孙', '子车', '百里', '谷梁', '宰父', '夹谷', '拓跋', '尉迟', '公羊', '壤驷', '乐正',
                    '漆雕', '公西', '巫马', '端木', '皇甫']

        return textList

    elif num == '2500':
        # 一画 至 23画
        text = """
        一,乙,
        二,十,丁,厂,七,卜,人,入,八,九,几,儿,了,力,乃,刀,又,
        三,于,干,亏,士,工,土,才,寸,下,大,丈,与,万,上,小,口,巾,山,千,乞,川,亿,个,勺,久,凡,及,夕,丸,么,广,亡,门,义,之,尸,弓,己,已,子,卫,也,女,飞,刃,习,叉,马,乡,
        丰,王,井,开,夫,天,无,元,专,云,扎,艺,木,五,支,厅,不,太,犬,区,历,尤,友,匹,车,巨,牙,屯,比,互,切,瓦,止,少,日,中,冈,贝,内,水,见,午,牛,手,毛,气,升,长,仁,什,片,仆,化,仇,币,仍,仅,斤,爪,反,介,父,从,今,凶,分,乏,公,仓,月,氏,勿,欠,风,丹,匀,乌,凤,勾,文,六,方,火,为,斗,忆,订,计,户,认,心,尺,引,丑,巴,孔,队,办,以,允,予,劝,双,书,幻,
        玉,刊,示,末,未,击,打,巧,正,扑,扒,功,扔,去,甘,世,古,节,本,术,可,丙,左,厉,右,石,布,龙,平,灭,轧,东,卡,北,占,业,旧,帅,归,且,旦,目,叶,甲,申,叮,电,号,田,由,史,只,央,兄,叼,叫,另,叨,叹,四,生,失,禾,丘,付,仗,代,仙,们,仪,白,仔,他,斥,瓜,乎,丛,令,用,甩,印,乐,句,匆,册,犯,外,处,冬,鸟,务,包,饥,主,市,立,闪,兰,半,汁,汇,头,汉,宁,穴,它,讨,写,让,礼,训,必,议,讯,记,永,司,尼,民,出,辽,奶,奴,加,召,皮,边,发,孕,圣,对,台,矛,纠,母,幼,丝,
        式,刑,动,扛,寺,吉,扣,考,托,老,执,巩,圾,扩,扫,地,扬,场,耳,共,芒,亚,芝,朽,朴,机,权,过,臣,再,协,西,压,厌,在,有,百,存,而,页,匠,夸,夺,灰,达,列,死,成,夹,轨,邪,划,迈,毕,至,此,贞,师,尘,尖,劣,光,当,早,吐,吓,虫,曲,团,同,吊,吃,因,吸,吗,屿,帆,岁,回,岂,刚,则,肉,网,年,朱,先,丢,舌,竹,迁,乔,伟,传,乒,乓,休,伍,伏,优,伐,延,件,任,伤,价,份,华,仰,仿,伙,伪,自,血,向,似,后,行,舟,全,会,杀,合,兆,企,众,爷,伞,创,肌,朵,杂,危,旬,旨,负,各,名,多,争,色,壮,冲,冰,庄,庆,亦,刘,齐,交,次,衣,产,决,充,妄,闭,问,闯,羊,并,关,米,灯,州,汗,污,江,池,汤,忙,兴,宇,守,宅,字,安,讲,军,许,论,农,讽,设,访,寻,那,迅,尽,导,异,孙,阵,阳,收,阶,阴,防,奸,如,妇,好,她,妈,戏,羽,观,欢,买,红,纤,级,约,纪,驰,巡,
        寿,弄,麦,形,进,戒,吞,远,违,运,扶,抚,坛,技,坏,扰,拒,找,批,扯,址,走,抄,坝,贡,攻,赤,折,抓,扮,抢,孝,均,抛,投,坟,抗,坑,坊,抖,护,壳,志,扭,块,声,把,报,却,劫,芽,花,芹,芬,苍,芳,严,芦,劳,克,苏,杆,杠,杜,材,村,杏,极,李,杨,求,更,束,豆,两,丽,医,辰,励,否,还,歼,来,连,步,坚,旱,盯,呈,时,吴,助,县,里,呆,园,旷,围,呀,吨,足,邮,男,困,吵,串,员,听,吩,吹,呜,吧,吼,别,岗,帐,财,针,钉,告,我,乱,利,秃,秀,私,每,兵,估,体,何,但,伸,作,伯,伶,佣,低,你,住,位,伴,身,皂,佛,近,彻,役,返,余,希,坐,谷,妥,含,邻,岔,肝,肚,肠,龟,免,狂,犹,角,删,条,卵,岛,迎,饭,饮,系,言,冻,状,亩,况,床,库,疗,应,冷,这,序,辛,弃,冶,忘,闲,间,闷,判,灶,灿,弟,汪,沙,汽,沃,泛,沟,没,沈,沉,怀,忧,快,完,宋,宏,牢,究,穷,灾,良,证,启,评,补,初,社,识,诉,诊,词,译,君,灵,即,层,尿,尾,迟,局,改,张,忌,际,陆,阿,陈,阻,附,妙,妖,妨,努,忍,劲,鸡,驱,纯,纱,纳,纲,驳,纵,纷,纸,纹,纺,驴,纽,
        奉,玩,环,武,青,责,现,表,规,抹,拢,拔,拣,担,坦,押,抽,拐,拖,拍,者,顶,拆,拥,抵,拘,势,抱,垃,拉,拦,拌,幸,招,坡,披,拨,择,抬,其,取,苦,若,茂,苹,苗,英,范,直,茄,茎,茅,林,枝,杯,柜,析,板,松,枪,构,杰,述,枕,丧,或,画,卧,事,刺,枣,雨,卖,矿,码,厕,奔,奇,奋,态,欧,垄,妻,轰,顷,转,斩,轮,软,到,非,叔,肯,齿,些,虎,虏,肾,贤,尚,旺,具,果,味,昆,国,昌,畅,明,易,昂,典,固,忠,咐,呼,鸣,咏,呢,岸,岩,帖,罗,帜,岭,凯,败,贩,购,图,钓,制,知,垂,牧,物,乖,刮,秆,和,季,委,佳,侍,供,使,例,版,侄,侦,侧,凭,侨,佩,货,依,的,迫,质,欣,征,往,爬,彼,径,所,舍,金,命,斧,爸,采,受,乳,贪,念,贫,肤,肺,肢,肿,胀,朋,股,肥,服,胁,周,昏,鱼,兔,狐,忽,狗,备,饰,饱,饲,变,京,享,店,夜,庙,府,底,剂,郊,废,净,盲,放,刻,育,闸,闹,郑,券,卷,单,炒,炊,炕,炎,炉,沫,浅,法,泄,河,沾,泪,油,泊,沿,泡,注,泻,泳,泥,沸,波,泼,泽,治,怖,性,怕,怜,怪,学,宝,宗,定,宜,审,宙,官,空,帘,实,试,郎,诗,肩,房,诚,衬,衫,视,话,诞,询,该,详,建,肃,录,隶,居,届,刷,屈,弦,承,孟,孤,陕,降,限,妹,姑,姐,姓,始,驾,参,艰,线,练,组,细,驶,织,终,驻,驼,绍,经,贯,
        奏,春,帮,珍,玻,毒,型,挂,封,持,项,垮,挎,城,挠,政,赴,赵,挡,挺,括,拴,拾,挑,指,垫,挣,挤,拼,挖,按,挥,挪,某,甚,革,荐,巷,带,草,茧,茶,荒,茫,荡,荣,故,胡,南,药,标,枯,柄,栋,相,查,柏,柳,柱,柿,栏,树,要,咸,威,歪,研,砖,厘,厚,砌,砍,面,耐,耍,牵,残,殃,轻,鸦,皆,背,战,点,临,览,竖,省,削,尝,是,盼,眨,哄,显,哑,冒,映,星,昨,畏,趴,胃,贵,界,虹,虾,蚁,思,蚂,虽,品,咽,骂,哗,咱,响,哈,咬,咳,哪,炭,峡,罚,贱,贴,骨,钞,钟,钢,钥,钩,卸,缸,拜,看,矩,怎,牲,选,适,秒,香,种,秋,科,重,复,竿,段,便,俩,贷,顺,修,保,促,侮,俭,俗,俘,信,皇,泉,鬼,侵,追,俊,盾,待,律,很,须,叙,剑,逃,食,盆,胆,胜,胞,胖,脉,勉,狭,狮,独,狡,狱,狠,贸,怨,急,饶,蚀,饺,饼,弯,将,奖,哀,亭,亮,度,迹,庭,疮,疯,疫,疤,姿,亲,音,帝,施,闻,阀,阁,差,养,美,姜,叛,送,类,迷,前,首,逆,总,炼,炸,炮,烂,剃,洁,洪,洒,浇,浊,洞,测,洗,活,派,洽,染,济,洋,洲,浑,浓,津,恒,恢,恰,恼,恨,举,觉,宣,室,宫,宪,突,穿,窃,客,冠,语,扁,袄,祖,神,祝,误,诱,说,诵,垦,退,既,屋,昼,费,陡,眉,孩,除,险,院,娃,姥,姨,姻,娇,怒,架,贺,盈,勇,怠,柔,垒,绑,绒,结,绕,骄,绘,给,络,骆,绝,绞,统,
        耕,耗,艳,泰,珠,班,素,蚕,顽,盏,匪,捞,栽,捕,振,载,赶,起,盐,捎,捏,埋,捉,捆,捐,损,都,哲,逝,捡,换,挽,热,恐,壶,挨,耻,耽,恭,莲,莫,荷,获,晋,恶,真,框,桂,档,桐,株,桥,桃,格,校,核,样,根,索,哥,速,逗,栗,配,翅,辱,唇,夏,础,破,原,套,逐,烈,殊,顾,轿,较,顿,毙,致,柴,桌,虑,监,紧,党,晒,眠,晓,鸭,晃,晌,晕,蚊,哨,哭,恩,唤,啊,唉,罢,峰,圆,贼,贿,钱,钳,钻,铁,铃,铅,缺,氧,特,牺,造,乘,敌,秤,租,积,秧,秩,称,秘,透,笔,笑,笋,债,借,值,倚,倾,倒,倘,俱,倡,候,俯,倍,倦,健,臭,射,躬,息,徒,徐,舰,舱,般,航,途,拿,爹,爱,颂,翁,脆,脂,胸,胳,脏,胶,脑,狸,狼,逢,留,皱,饿,恋,桨,浆,衰,高,席,准,座,脊,症,病,疾,疼,疲,效,离,唐,资,凉,站,剖,竞,部,旁,旅,畜,阅,羞,瓶,拳,粉,料,益,兼,烤,烘,烦,烧,烛,烟,递,涛,浙,涝,酒,涉,消,浩,海,涂,浴,浮,流,润,浪,浸,涨,烫,涌,悟,悄,悔,悦,害,宽,家,宵,宴,宾,窄,容,宰,案,请,朗,诸,读,扇,袜,袖,袍,被,祥,课,谁,调,冤,谅,谈,谊,剥,恳,展,剧,屑,弱,陵,陶,陷,陪,娱,娘,通,能,难,预,桑,绢,绣,验,继,
        球,理,捧,堵,描,域,掩,捷,排,掉,堆,推,掀,授,教,掏,掠,培,接,控,探,据,掘,职,基,著,勒,黄,萌,萝,菌,菜,萄,菊,萍,菠,营,械,梦,梢,梅,检,梳,梯,桶,救,副,票,戚,爽,聋,袭,盛,雪,辅,辆,虚,雀,堂,常,匙,晨,睁,眯,眼,悬,野,啦,晚,啄,距,跃,略,蛇,累,唱,患,唯,崖,崭,崇,圈,铜,铲,银,甜,梨,犁,移,笨,笼,笛,符,第,敏,做,袋,悠,偿,偶,偷,您,售,停,偏,假,得,衔,盘,船,斜,盒,鸽,悉,欲,彩,领,脚,脖,脸,脱,象,够,猜,猪,猎,猫,猛,馅,馆,凑,减,毫,麻,痒,痕,廊,康,庸,鹿,盗,章,竟,商,族,旋,望,率,着,盖,粘,粗,粒,断,剪,兽,清,添,淋,淹,渠,渐,混,渔,淘,液,淡,深,婆,梁,渗,情,惜,惭,悼,惧,惕,惊,惨,惯,寇,寄,宿,窑,密,谋,谎,祸,谜,逮,敢,屠,弹,随,蛋,隆,隐,婚,婶,颈,绩,绪,续,骑,绳,维,绵,绸,绿,
        琴,斑,替,款,堪,搭,塔,越,趁,趋,超,提,堤,博,揭,喜,插,揪,搜,煮,援,裁,搁,搂,搅,握,揉,斯,期,欺,联,散,惹,葬,葛,董,葡,敬,葱,落,朝,辜,葵,棒,棋,植,森,椅,椒,棵,棍,棉,棚,棕,惠,惑,逼,厨,厦,硬,确,雁,殖,裂,雄,暂,雅,辈,悲,紫,辉,敞,赏,掌,晴,暑,最,量,喷,晶,喇,遇,喊,景,践,跌,跑,遗,蛙,蛛,蜓,喝,喂,喘,喉,幅,帽,赌,赔,黑,铸,铺,链,销,锁,锄,锅,锈,锋,锐,短,智,毯,鹅,剩,稍,程,稀,税,筐,等,筑,策,筛,筒,答,筋,筝,傲,傅,牌,堡,集,焦,傍,储,奥,街,惩,御,循,艇,舒,番,释,禽,腊,脾,腔,鲁,猾,猴,然,馋,装,蛮,就,痛,童,阔,善,羡,普,粪,尊,道,曾,焰,港,湖,渣,湿,温,渴,滑,湾,渡,游,滋,溉,愤,慌,惰,愧,愉,慨,割,寒,富,窜,窝,窗,遍,裕,裤,裙,谢,谣,谦,属,屡,强,粥,疏,隔,隙,絮,嫂,登,缎,缓,编,骗,缘,
        瑞,魂,肆,摄,摸,填,搏,塌,鼓,摆,携,搬,摇,搞,塘,摊,蒜,勤,鹊,蓝,墓,幕,蓬,蓄,蒙,蒸,献,禁,楚,想,槐,榆,楼,概,赖,酬,感,碍,碑,碎,碰,碗,碌,雷,零,雾,雹,输,督,龄,鉴,睛,睡,睬,鄙,愚,暖,盟,歇,暗,照,跨,跳,跪,路,跟,遣,蛾,蜂,嗓,置,罪,罩,错,锡,锣,锤,锦,键,锯,矮,辞,稠,愁,筹,签,简,毁,舅,鼠,催,傻,像,躲,微,愈,遥,腰,腥,腹,腾,腿,触,解,酱,痰,廉,新,韵,意,粮,数,煎,塑,慈,煤,煌,满,漠,源,滤,滥,滔,溪,溜,滚,滨,粱,滩,慎,誉,塞,谨,福,群,殿,辟,障,嫌,嫁,叠,缝,缠,
        静,碧,璃,墙,撇,嘉,摧,截,誓,境,摘,摔,聚,蔽,慕,暮,蔑,模,榴,榜,榨,歌,遭,酷,酿,酸,磁,愿,需,弊,裳,颗,嗽,蜻,蜡,蝇,蜘,赚,锹,锻,舞,稳,算,箩,管,僚,鼻,魄,貌,膜,膊,膀,鲜,疑,馒,裹,敲,豪,膏,遮,腐,瘦,辣,竭,端,旗,精,歉,熄,熔,漆,漂,漫,滴,演,漏,慢,寨,赛,察,蜜,谱,嫩,翠,熊,凳,骡,缩,
        慧,撕,撒,趣,趟,撑,播,撞,撤,增,聪,鞋,蕉,蔬,横,槽,樱,橡,飘,醋,醉,震,霉,瞒,题,暴,瞎,影,踢,踏,踩,踪,蝶,蝴,嘱,墨,镇,靠,稻,黎,稿,稼,箱,箭,篇,僵,躺,僻,德,艘,膝,膛,熟,摩,颜,毅,糊,遵,潜,潮,懂,额,慰,劈,
        操,燕,薯,薪,薄,颠,橘,整,融,醒,餐,嘴,蹄,器,赠,默,镜,赞,篮,邀,衡,膨,雕,磨,凝,辨,辩,糖,糕,燃,澡,激,懒,壁,避,缴,
        戴,擦,鞠,藏,霜,霞,瞧,蹈,螺,穗,繁,辫,赢,糟,糠,燥,臂,翼,骤,
        鞭,覆,蹦,镰,翻,鹰,
        警,攀,蹲,颤,瓣,爆,疆,
        壤,耀,躁,嚼,嚷,籍,魔,灌,
        蠢,霸,露,
        囊,
        罐
        """

        text = text.replace("\n", "").replace(" ", "")
        retext = text.split(",")
        return retext

    elif num == '3000':
        test500 = ['戎', '尔', '昵', '侯', '兜', '轴', '伊', '谓', '乾', '哩', '萨', '措', '溶', '爵', '犀', '邦', '俄', '埃', '彪', '柬',
                   '琳', '频', '砂', '迂', '硫', '伦', '廷', '赫', '综', '函', '宦', '呵', '诺', '碳', '洛', '泵', '署', '焊', '菲', '咧',
                   '姊', '嗡', '袁', '磷', '秦', '滞', '娶', '媳', '哎', '姆', '雇', '贾', '澳', '颇', '胎', '碱', '枚', '卢', '氢', '奈',
                   '辑', '曼', '莱', '艾', '譬', '氯', '拟', '寂', '儒', '隅', '勃', '戈', '吏', '吁', '啥', '翔', '渤', '赐', '阐', '邓',
                   '穆', '铝', '蝙', '锥', '弧', '仲', '瓷', '敦', '凌', '蟹', '舶', '祈', '缚', '凛', '怔', '铣', '履', '硅', '匈', '郭',
                   '卑', '凸', '韩', '氨', '抑', '契', '贮', '甫', '昭', '卓', '梧', '谬', '磅', '魏', '钠', '霍', '谴', '芯', '氮', '蒋',
                   '帕', '钙', '褐', '哼', '辐', '杭', '勘', '淀', '衷', '蒂', '徽', '俺', '菩', '涕', '癌', '勋', '敷', '刨', '兢', '钦',
                   '坯', '鹏', '拱', '纬', '椿', '颁', '哟', '媒', '讼', '猿', '吱', '账', '酵', '暇', '晤', '诡', '肖', '钾', '粹', '蒲',
                   '硝', '丐', '曹', '棱', '巢', '掷', '歧', '凹', '淮', '拓', '醇', '裸', '咨', '籽', '珊', '姚', '捂', '豫', '聘', '屏',
                   '氛', '衍', '熙', '栈', '彭', '蜗', '逸', '凿', '潘', '蝗', '鸿', '瞪', '绅', '苇', '藤', '吕', '瘤', '驮', '郁',
                   '湘', '崩', '棘', '觅', '粤', '涡', '卿', '衙', '靖', '腺', '舆', '罕', '逻', '辖', '枢', '诬', '趾', '幽', '缔', '赋',
                   '锭', '锌', '冯', '寡', '斋', '涤', '婿', '浦', '玛', '谐', '萧', '刹', '溃', '嘿', '孵', '馏', '坎', '雌', '岳', '庞',
                   '胚', '晰', '捣', '奠', '祭', '弥', '挫', '怯', '吟', '拧', '婴', '叭', '吻', '篷', '疟', '玫', '栓', '颖', '玄', '桩',
                   '屁', '泣', '诈', '簇', '缆', '墩', '瞬', '蔗', '噪', '韧', '篡', '肪', '寓', '啼', '殷', '憾', '耸', '峻', '恕', '焚',
                   '玲', '鼎', '甸', '兑', '饵', '稚', '鹤', '凄', '痴', '椭', '逊', '豺', '檐', '溢', '扳', '逛', '沼', '踱', '鳄', '棺',
                   '迄', '蛉', '嵌', '镀', '雏', '枉', '稽', '咒', '瑰', '沥', '喧', '彰', '庇', '泌', '砸', '搀', '灼', '茬', '萎', '鳞',
                   '咕', '杉', '淑', '坠', '栖', '焕', '糙', '蝉', '僧', '邢', '嚣', '闺', '螟', '嘲', '镶', '葫', '汛', '筷', '苟', '铭',
                   '忿', '骚', '昧', '潭', '昔', '礁', '梗', '畔', '梭', '懈', '讥', '乍', '厢', '豁', '澄', '囚', '矢', '栅', '蔓', '聊',
                   '沪', '颊', '惶', '遂', '虐', '嗅', '鲸', '鞍', '尉', '撮', '恍', '喻', '耿', '仑', '鹉', '眷', '椎', '荆', '汰', '缅',
                   '拙', '琼', '谭', '磕', '剿', '耙', '汞', '靴', '鲤', '藻', '蚜', '洼', '枫', '煞', '褂', '懊', '烹', '杖', '赦', '睦',
                   '蕴', '窖', '夷', '瞻', '蕾', '苔', '魁', '渊', '锰', '钝', '熏', '翰', '楞', '宛', '矫', '菱', '啡', '捍', '蔫', '溅',
                   '歹', '篱', '闽', '汹', '媚', '隧', '畦', '硕', '妆', '芭', '蚌', '埝', '腕', '揖', '堕', '薛', '聂', '哺', '亥', '伺',
                   '寝', '捶', '秉', '箍', '氓', '磺', '壕', '廓', '蹬', '祷', '佑', '骇', '躯', '鳍', '淫', '毡', '竣', '舵', '眶', '囱',
                   '翘', '揩', '椰', '碘', '钧', '咖', '蓉', '寞', '熬', '蛹', '赎', '阎', '橱', '膳', '驯', '窟', '瑟', '隘', '娜', '朦',
                   '羔', '酌', '圃', '黍', '蟆', '呕', '巍', '畸', '擅', '柑', '钮', '畴', '彬', '缕', '屉', '砚', '楔', '腻']

        #  啰、瞭、稟
        return test500 + changyongzi("2500")

    elif num == '3500':
        text500 = ['匕', '刁', '夭', '冗', '夯', '叽', '皿', '芋', '芍', '吆', '屹', '臼', '肋', '旭', '凫', '讳', '讶', '讹', '诀', '弛',
                   '阱', '纫', '玖', '抠', '扼', '抡', '坞', '抒', '芙', '芜', '芥', '巫', '杈', '匣', '轩', '卤', '吠', '呐', '呛', '吭',
                   '邑', '囤', '吮', '岖', '牡', '佃', '肛', '肘', '狈', '鸠', '彤', '灸', '吝', '庐', '闰', '沐', '沛', '沦', '沧', '忱',
                   '诅', '妓', '妒', '卦', '坷', '坪', '坤', '拄', '拂', '拇', '拗', '茉', '苛', '苫', '苞', '茁', '矾', '奄', '殴', '昙',
                   '咙', '呻', '咆', '贬', '侠', '侥', '侣', '侈', '刽', '肴', '瓮', '肮', '狞', '疙', '疚', '卒', '炬', '沽', '沮', '泞',
                   '宠', '衩', '帚', '陋', '陌', '虱', '驹', '绊', '绎', '贰', '玷', '拭', '拷', '挟', '垢', '垛', '拯', '茸', '荚', '茵',
                   '茴', '荞', '荠', '荤', '荧', '荔', '柠', '枷', '鸥', '韭', '盹', '盅', '哆', '咪', '秕', '俏', '俐', '徊', '胧', '狰',
                   '峦', '奕', '飒', '娄', '烁', '炫', '柒', '涎', '恃', '恬', '恤', '诫', '祠', '诲', '屎', '陨', '蚤', '匿', '埂', '捌',
                   '挚', '捅', '荸', '莽', '莉', '莹', '莺', '梆', '桦', '桅', '砰', '砾', '殉', '逞', '哮', '唠', '剔', '蚣', '蚪', '蚓',
                   '鸯', '唁', '唧', '唆', '峭', '赂', '赃', '铆', '秫', '笆', '赁', '倔', '舀', '豹', '胯', '胰', '脐', '脓', '鸵', '鸳',
                   '馁', '疹', '紊', '烙', '涣', '涧', '涩', '悍', '悯', '窍', '诽', '袒', '谆', '祟', '娩', '骏', '琐', '麸', '琉', '琅',
                   '捺', '埠', '捻', '掐', '掂', '掖', '掸', '掺', '萤', '菇', '酝', '酗', '奢', '盔', '匾', '颅', '晦', '冕', '啃', '蛆',
                   '蚯', '蛀', '唬', '唾', '啤', '啸', '崎', '崔', '赊', '铐', '铛', '铡', '秸', '秽', '笙', '笤', '偎', '傀', '衅',
                   '徘', '舷', '敛', '翎', '脯', '凰', '猖', '庶', '庵', '痊', '涯', '淌', '淆', '淳', '淤', '涮', '涵', '惦', '悴', '惋',
                   '窒', '谍', '裆', '袱', '谒', '谚', '婉', '绰', '绷', '绽', '缀', '琢', '揍', '堰', '揽', '揣', '搓', '壹', '搔', '募',
                   '榔', '粟', '酣', '酥', '雳', '棠', '喳', '遏', '晾', '跋', '跛', '蛔', '蜒', '蛤', '鹃', '锉', '甥', '掰', '筏', '牍',
                   '逾', '腌', '腋', '猩', '猬', '惫', '痘', '痢', '痪', '焙', '渺', '湃', '愕', '窘', '谤', '搪', '斟', '靶', '蓖', '蒿',
                   '楷', '榄', '楣', '酪', '硼', '碉', '睹', '瞄', '嗜', '嗦', '跷', '跺', '蜈', '蜕', '嗤', '蜀', '幌', '锚', '锨', '颓',
                   '腮', '肄', '馍', '禀', '痹', '誊', '漓', '溯', '滓', '溺', '窥', '嫉', '缤', '赘', '摹', '蔼', '蔚', '榛', '榕', '碟',
                   '碴', '辕', '墅', '嘁', '踊', '嘀', '幔', '舔', '箕', '箫', '瘩', '瘟', '漱', '漩', '漾', '慷', '寥', '裉', '嫡', '缨',
                   '撵', '撩', '撬', '擒', '撰', '蕊', '樊', '樟', '橄', '豌', '碾', '嘶', '嘹', '蝠', '蝎', '蝌', '幢', '镊', '镐', '篓',
                   '膘', '鲫', '褒', '瘪', '瘫', '憋', '澎', '潦', '澈', '澜', '憔', '憎', '翩', '褥', '憨', '嬉', '缭', '撼', '擂', '薇',
                   '擎', '噩', '橙', '瓢', '霎', '辙', '冀', '蹂', '螃', '鹦', '黔', '篙', '瘾', '瘸', '燎', '濒', '窿', '缰', '藐', '檬',
                   '檩', '檀', '瞳', '曙', '蹋', '蟋', '蟀', '嚎', '赡', '镣', '儡', '臊', '糜', '懦', '臀', '藕', '癞', '瀑', '襟',
                   '璧', '戳', '攒', '孽', '蘑', '蹭', '簸', '簿', '靡', '癣', '羹', '鳖', '鬓', '攘', '蠕', '糯', '霹', '躏', '髓', '蘸',
                   '瓤', '矗']

        return text500 + changyongzi("3000")

    elif num == 'yuliao':
        # 比3500字多出来的字符  664个
        #这 22个字符暂无数据 ['罒', '啰', '態', '翃', '糹', '卄', '瞭', '乚', '姞', '逹', '乛', '暁', '曈', '渏', '夆', '嘡', '砲', '廋', '怱', '皊', '祇', '晞']

        text = ['缥', '饯', '戮', '杳', '褶', '峨', '霄', '禅', '孜', '寰', '鲈', '莴', '亵', '钅', '曳', '羲', '徵', '拎', '桉', '曦', '倩', '佚',
         '茗', '蜍', '萼', '钰', '婀', '铤', '萋', '磬', '溟', '郦', '奘', '莓', '酞', '矣', '犟', '粼', '蔺', '斓', '匮', '咛', '厝', '笠',
         '潸', '籁', '伢', '柚', '娟', '酉', '颉', '娑', '弗', '鹂', '煜', '罔', '栩', '懵', '钴', '蹒', '婷', '樵', '箬', '蛟', '抿', '嗣',
         '盎', '鹭', '琥', '滟', '兮', '筵', '渝', '祁', '纶', '兀', '戌', '纰', '窕', '妃', '霓', '疒', '辍', '咋', '弩', '咤', '跤', '銮',
         '腭', '孢', '蹊', '珐', '媪', '徜', '浒', '哇', '衮', '匚', '篝', '呱', '拈', '炯', '纟', '汲', '潇', '璎', '姬', '颐', '忄', '啪',
         '忏', '倌', '扌', '墟', '箴', '嘘', '蚩', '俑', '嗒', '拽', '讠', '诠', '诙', '煦', '侃', '炙', '脍', '憩', '帷', '惚', '祀', '胤',
         '阑', '喔', '钲', '郡', '徇', '诣', '嫦', '幂', '怆', '炖', '涟', '荼', '髫', '汐', '傣', '胫', '箪', '曝', '孀', '陇', '缪', '岑',
         '盂', '扦', '朔', '莎', '蜢', '湛', '赧', '硖', '衤', '渚', '褛', '岱', '沓', '樾', '簪', '皎', '邯', '瘙', '狩', '熠', '仞', '徙',
         '楫', '邈', '翱', '隋', '殇', '婪', '弘', '怅', '擢', '喙', '伽', '磊', '憬', '汝', '哐', '菽', '碣', '孺', '浣', '噜', '梓', '妞',
         '亻', '膈', '哔', '诎', '钊', '巳', '哉', '隽', '踵', '黯', '啬', '砺', '镯', '眦', '晖', '麾', '陂', '屐', '忒', '谛', '咀', '琶',
         '丫', '逵', '瞟', '擞', '冉', '浏', '禹', '栀', '咯', '洵', '皑', '瞰', '斌', '倜', '怩', '砒', '韦', '粽', '蕙', '哞', '毽', '睢',
         '茹', '陀', '铮', '谧', '颧', '渲', '艄', '迤', '腑', '嘎', '娆', '薰', '獠', '冥', '偃', '骼', '虞', '踮', '喵', '眺', '熹', '禄',
         '睾', '怡', '芸', '绦', '厥', '尬', '孚', '瞥', '冫', '蝥', '羌', '瑜', '皓', '岚', '菡', '恺', '廖', '迸', '阝', '翡', '霖', '猝',
         '涿', '帛', '铿', '泗', '踌', '珀', '岐', '霏', '烬', '瞌', '驷', '氵', '锫', '谡', '馈', '啧', '徭', '裘', '苣', '逶', '踞', '襄',
         '宀', '睑', '鲍', '沁', '迪', '龚', '凋', '鸢', '噤', '潋', '砝', '殆', '眩', '彷', '纭', '搡', '崛', '亠', '睫', '褴', '琵', '恿',
         '忡', '靛', '涸', '遁', '逑', '恻', '蚱', '浃', '鳃', '邹', '礴', '箸', '遨', '柯', '巅', '徨', '篾', '枇', '尴', '苑', '翳', '窈',
         '沆', '濡', '驸', '嶂', '惮', '茏', '呖', '刂', '娴', '恣', '磐', '萦', '斛', '虔', '耘', '汴', '睿', '戾', '犷', '蚍', '卉', '掣',
         '蛰', '倪', '沔', '渎', '瘁', '噼', '杷', '荇', '荫', '岷', '佯', '茨', '垠', '胄', '噬', '嘟', '匡', '跚', '娥', '傥', '貉', '娓',
         '钨', '迥', '鑫', '曰', '躇', '咩', '鳜', '哽', '戍', '戛', '烊', '瀚', '淞', '馨', '褪', '丿', '忐', '忖', '炳', '臆', '觑', '蕃',
         '埔', '姗', '溆', '迢', '旎', '蔡', '藩', '酚', '胭', '潺', '喋', '湍', '汶', '囵', '绛', '倭', '螂', '坍', '愠', '瑚', '箧', '柝',
         '丞', '佬', '轲', '焉', '螳', '札', '妩', '槛', '忸', '袅', '囔', '敝', '愎', '祗', '佼', '妍', '幄', '镁', '绚', '茱', '囫', '婢',
         '凇', '缈', '亘', '蓼', '瞅', '羚', '胱', '讫', '厄', '敕', '戟', '庚', '榭', '渑', '踝', '憧', '濯', '萸', '丨', '娲', '嗑', '萃',
         '炽', '瞠', '闼', '姹', '稷', '皙', '蛱', '惆', '婵', '蒌', '郸', '谪', '俨', '阙', '轶', '孰', '惘', '抉', '琪', '瑛', '叩', '枥',
         '恪', '怂', '钗', '锵', '篆', '聆', '掇', '裴', '湄', '翟', '璀', '谰', '淇', '锂', '鞅', '氟', '矜', '啜', '呤', '寐', '澹', '诘',
         '祯', '沤', '辶', '笃', '羿', '诓', '鄂', '丶', '黠', '轼', '蹿', '萏', '蔻', '簧', '穹', '藜', '黏', '嘻', '邃', '镍', '匐', '豚',
         '啭', '咚', '咣', '瞑', '氖', '圭', '隼', '悚', '沏', '蜉', '塾', '艹', '熨', '耒', '壬', '哦', '丕', '泸', '瑙', '鞑', '嗖', '铍',
         '氅', '骥', '竽', '蕨', '漪', '怍', '扉', '蜿', '魅', '腱', '嘈', '髻', '铄', '撺', '彳', '诳', '晁', '喑', '祺', '淼', '绮', '戊',
         '鲟', '愣', '嘭', '璐', '惟', '啷', '葆', '藉', '氰', '冽', '滕', '罄', '嬴', '雍', '缉', '杼', '蓑', '忑', '锲', '瞩', '辘', '砀',
         '眈', '曛', '裔', '奚', '伛', '窠', '恙', '竦', '淅', '沌', '蟾', '徉', '烽', '氦', '昀', '绫', '吒', '叱', '剐', '峙', '涅', '伫',
         '遐', '馐', '氩', '淙', '阮', '咄', '黛', '棹', '洮', '臧', '璨', '摞', '瑕', '吾', '炀', '杵', '藓', '蟠', '逍', '珑', '剜', '犭',
         '卯', '蜷', '馥', '骋']

        return text + changyongzi("3500")

# 获取当前路径下的所有图片，返回列表
def get_allimg(path:str):
    imgList = []
    for root, dirs, files in os.walk(path):
        for filename in files:
            if os.path.splitext(filename)[-1] in ['.png','.jpg']:
                imgList.append(os.path.join(root,filename))
    return imgList


# 获取txt里面的所有路径，传入一个字符列表，得到一个字典。   路径下所有的子路径里面的所有图片   返回字典，文件名：图片路径
def getFormtxt_imgDict(zifuList:list, txtpath):

    pathDict = {}

    with open(txtpath,'r',encoding='utf-8') as f:
        infoList = f.readlines()
    for zifu in zifuList:
        pathDict[zifu] = [info.split()[1] for info in infoList if info[0] == zifu]


    return pathDict


# 获取路径下所有的子路径里面的所有图片   返回字典，文件名：图片路径
def get_imgpathDict(path:str):
    imgDict ={}
    imgfiledir = os.listdir(path)
    for filename in imgfiledir:
        if os.path.isdir(os.path.join(path,filename)):
            imgDict[filename] = get_allimg(os.path.join(path,filename))
    return imgDict



def get_label(labeltype :str,yuliao):
    """
    生成需要书写的数据 返回一个字符串
    labeltype : 对应不同的 数据类型，有名字数据，


    :param labeltype:
    :return:
    """

    if labeltype == "bjx":
        # bjxList = changyongzi('bjx')  # 获取百家姓
        # bjxDict_num = {xing: 3000 for xing in bjxList}
        global bjxList               # global 用法有问题
        xing_label = random.choice(yuliao[0])

        # mingziList = changyongzi('500')[:10]  # 获取常用2500字
        mingzi_label = random.choices(yuliao[1], k=random.choice([1, 2, 2, 2, 2]))  # 随机获取一个字或者2个字
        # label = xing_label + ''.join(mingzi_label)
        return (xing_label, ''.join(mingzi_label))

    elif labeltype == 'text':
        textList = changyongzi("yuliao")
        ss = random.choice(yuliao)
        if "\n" in ss:
            ss = ss[:-1]

        for s in ss:
            if s not in textList:
                ss = ss.replace(s,"")
        return ss




def make_yuliaoku():
    label = open('E:/Pytorch/PaddleOCR-release-2.2/train_data/chiese_all_train.txt','r',encoding= 'utf-8').readlines()
    labelList = []
    yuliao = open('E:/Pytorch/make_handwriting_img/yuliaokufuhao.txt','w',encoding= 'utf-8')

    for ss in label:
        ss = ss[:-1].split('\t')[1]
        infoch = re.findall('[\u4e00-\u9fa5，。：]', ss)


        fhList = ['，', '。','：']


        num = 0
        for s in infoch:
            if s in fhList:
                num+=1
        if len(infoch)>num :
            if infoch[0] in fhList:
                infoch.pop(0)
            labelList.append(''.join(infoch) + "\n")

    yuliao.writelines(labelList)
    yuliao.close()
    print(len(labelList))
    print(labelList)


def get_yuliaoku_zifu():
    yuliao = open('E:/Pytorch/make_handwriting_img/yuliaoku.txt', 'r', encoding='utf-8')

    yulist = []
    for s in yuliao:
        for ss in s:
            yulist.append(ss)
    return list(set(yulist))


def make_zifutxt():
    fw = open('D:\data\CASIA/train.txt','w',encoding='utf-8')
    l = []
    pathdim = "D:/data/CASIA/train/"
    imglist = os.listdir(pathdim)
    for name in imglist:
        paht = pathdim +name
        for imgname in get_allimg(paht):
            ss = name + ' ' + imgname + '\n'
            l.append(ss)

    fw.writelines(l)
    fw.close()





if __name__== "__main__":


    import math
    s = 1/math.sqrt(2)
    print(s/(1+math.sqrt(3)))

    imgD = np.ones((300, 100), dtype=np.uint8) * 255
    imgDi = cv2.cvtColor(imgD, cv2.COLOR_GRAY2BGR)


    cv2.imshow('te',imgDi)
    cv2.waitKey(0)


    # for i in range(300):
    #     mingzi_label = random.choices(text500, k=random.choice([1, 2, 2, 2, 2]))
    #     print(mingzi_label)
    # er = []
    # for s in changyongzi('3000'):
    #     if s not in ss:
    #         ss.append(s)
    #     else:
    #         er.append(s)
    # print(er)
    #
    #
    # print(len(changyongzi('3000')))
    # print([ch for ch in changyongzi('2500') if ch not in changyongzi('500')])
    # t = '司马、上官、欧阳、夏侯、诸葛、闻人、南宫、西门、东门、左丘、梁丘、颛孙、子车、百里、谷梁、宰父、夹谷、拓跋、尉迟、公羊、壤驷、乐正、漆雕、公西、巫马、端木、皇甫'
    # print(t.split("、"))